{
  "shoutCaster": "1. Use this option to enable or disable the automatic shoutout functionality of the script.\n\n2. If enabled, automatic shoutouts will be sent on chat for the casters saved on the script database, based on the settings defined on the fields below.\nOtherwise, shoutouts using the settings defined will be triggered just by command.",
  "shoutOnJoin": "1. Use this option to set the automatic shoutout behavior.\n\n2. If enabled, the automatic shoutout will be sent as soon as the chatbot detects a saved streamer joined your chat, wether they sent or not anything on chat.\nOtherwise, the automatic shoutout will be triggered only if they joined the stream AND has send their first message on your chat.",
  "shoutMessage": "1. Use this field to set the default message that will be used for the following situations:\n    a) Using the provided command to trigger a shoutout to an unsaved caster;\n    b) Saving streamers to the casters database if no custom message is setup.\n\n2. This message MUST contain the specified parameters, as described below:\n{caster} - this parameter will be replaced by the caster Twitch's username\n{game} - this will be replaced by the last game played by the saved caster on their streams\n{url} - this will be replaced by their Twitch's profile page\n{viewercount} - this will be replaced by the amount of viewers which raided you\n\n3. For more information about this, please refer the script documentation.",
  "shoutMode": "1. Use this option to select how the shoutout message will be sent on Twitch chat.\n\n2. For more information about this option, check the script documentation.",
  "shoutRaider": "1. Use this option to select if the script will send an automatic shoutout for raiders.\n\n2. Note that this option will capture any received raid and will trigger the shoutout for any streamer which has raided your channel, wether they are or not saved on the casters database, using the settings adjusted in this page.",
  "shoutRaiderCount": "1. Use this field to define the minimum amount of viwers the raider needs to bring up to your channel in order for the automatic shoutout to be triggered.\n\n2. The value HAS to be bigger than 0. The default minimum is 1 viewer.",
  "shoutRaiderMessage": "1. Use this field to set the default message that will be used for shouting out a caster when receiving a raid.\n\n2. This message MUST contain the specified parameters, as described below:\n{caster} - this parameter will be replaced by the caster Twitch's username\n{game} - this will be replaced by the last game played by the saved caster on their streams\n{url} - this will be replaced by their Twitch's profile page\n\n3. For more information about this, please refer the script documentation.",
  "saveRaider": "1. Use this option to automatically save a raider to the casters database, enabling the automatic shoutout for the next time they visit your stream.\n\n2. The entry created on the database, if this option is enabled, will have the default message setup on \"Message to be sent by default on shoutouts\" field.\nTo customize that specific raider message (if necessary), go to the page \"Casters Control\" and edit their specific entry.",
  "logDashOpen": "1. Use this option to open the Dashboard Logs folder",
  "logDashDelete": "1. Use this option to clear the Dashboard Logs folder, by deleting all logs stored.",
  "logScriptOpen": "1. Use this option to open the Script Logs folder",
  "logScriptDelete": "1. Use this option to clear the Script Logs folder, by deleting all files stored.",
  "logDeleteAll": "1. Use this option to delete all logs created by both the Dashboard and Script at once.",
  "restore": "1. Use this button to restore the last created backup of the settings saved in this page.\n\n2. If no backup files were found, nothing is going to happen when clicking this button.",
  "create": "1. Use this button to create a backup of the last saved settings.\n\n2. If a backup already exists, it will overwrite the previous backup saved.",
  "save": "1. Use this button to save the script settings required by Streamlabs Chatbot.\n\n2. If this is your first time running this application, the values in the fields of this page, were set to default values. It's optional to change them before creating/saving the settings file.",
  "openOverlayPreview": "1. Use this option to preview the desired appearance of the shoutout overlay in case one or more of the options below seems unclear of what they would change\n\n2. Once the preview is opened on your browswer, make use of that to change how the shoutout looks like\n\n3. The values used on the overlay playground have to be set on the fields below",
  "overlayFont": "1. Use this option to change the text font for the shoutout overlay\n\n2. Note that some font/font styles displayed on the \"Overlay Playground\" may not be the same seen here. For details about this, check the script documentation.",
  "overlayAnimation": "1. Use this option to select the desired animation method on which the overlay will be displayed on screen\n\n2. The selected animation will be played both at the begin and at the end of the overlay display, with reverse order of animation\n\n3. Be sure to play with the animation option in the \"Overlay Playground\" to preview the animation methods",
  "clipVolumeSetter": "1. Use this option to set the global volume level of the clips played\n\n2. This option only has effect if the option \"Display clip video with shoutout?\" is enabled\n\n3. Note that this is a global volume to the whole overlay - some clips may be too low or too high when played. Their individual reproducing sound level is based on the recoding volume when the clip was created, reason of why the suggested value for this field is 50 %, but feel free to adjust this if necessary",
  "displayClip": "1. Use this option to select if a random clip will be played with the shoutout\n\n2. If this options is set, the overlay will be visible on screen for the duration of the clip, otherwise, the shoutout overlay will be visible for 10 seconds, with simple text callout",
  "displayInfo": "1. Use this option to select if the played clip information (clip title and game played on the clip) will be displayed below the clip video\n\n2. This option onle has effect if the option \"Display clip video with shoutout?\" is enabled",
  "topTextColor": "1. Use this option to set the color of the text of the top part of the callout section of the overlay\n\n2. The value entered has to be provided as the HEX color code. For more information about this, check the script documentation\n\n3. It's also possible to use the button on the side to set the color value",
  "topBackgroundColor": "1. Use this option to set the background color of the top part of the callout section of the overlay\n\n2. The value entered has to be provided as the HEX color code. For more information about this, check the script documentation\n\n3. To change the opacity of the color, provide an HEX color code in the 8 digit format, instead of the usual 6 digit format, where the last to digits make reference to how opaque the background will be (00 means 0% opacitity and ff means 100% opacity)\n\n4. It's also possible to use the button on the side to set the color value",
  "bottomTextColor": "1. Use this option to set the color of the text of the bottom part of the callout section of the overlay\n\n2. The value entered has to be provided as the HEX color code. For more information about this, check the script documentation\n\n3. It's also possible to use the button on the side to set the color value",
  "bottomBackgroundColor": "1. Use this option to set the background color of the bottom part of the callout section of the overlay\n\n2. The value entered has to be provided as the HEX color code. For more information about this, check the script documentation\n\n3. To change the opacity of the color, provide an HEX color code in the 8 digit format, instead of the usual 6 digit format, where the last to digits make reference to how opaque the background will be (00 means 0% opacitity and ff means 100% opacity)\n\n4. It's also possible to use the button on the side to set the color value",
  "imagesBackgroundColor": "1. Use this option to set the background color of the images displayed on the callout section of the overlay\n\n2. The selected color will be the same for both the streamer thumbnail and the game thumbnail\n\n3. The value entered has to be provided as the HEX color code. For more information about this, check the script documentation\n\n4. To change the opacity of the color, provide an HEX color code in the 8 digit format, instead of the usual 6 digit format, where the last to digits make reference to how opaque the background will be (00 means 0% opacitity and ff means 100% opacity)\n\n5. It's also possible to use the button on the side to set the color value",
  "displayClipBorder": "1. Use this option to select if a border will be displayed around the clip and clip information sections of the overlay\n\n2. This option only has effect if the option \"Display clip video with shoutouts?\" is enabled",
  "clipBorderColor": "1. Use this option to set the border color which will be displated around the clip and clip information sections of the overlay\n\n2. This option only has effect if the options \"Display clip video with shoutouts?\" and \"Display border around clip?\" are enabled\n\n3. The value entered has to be provided as the HEX color code. For more information about this, check the script documentation\n\n4. To change the opacity of the color, provide an HEX color code in the 8 digit format, instead of the usual 6 digit format, where the last to digits make reference to how opaque the background will be (00 means 0% opacitity and ff means 100% opacity)\n\n5. It's also possible to use the button on the side to set the color value",
  "clipDividerColor": "1. Use this option to set the color of the divider line between the clip video and the clip information\n\n2. This option only has effect if the options \"Display clip video with shoutouts?\" and \"Display clip information when the clip is displayed on shoutouts?\" are enabled\n\n3. The value entered has to be provided as the HEX color code. For more information about this, check the script documentation\n\n4. To change the opacity of the color, provide an HEX color code in the 8 digit format, instead of the usual 6 digit format, where the last to digits make reference to how opaque the background will be (00 means 0% opacitity and ff means 100% opacity)\n\n5. It's also possible to use the button on the side to set the color value",
  "clipInfoTextColor": "1. Use this option to set the color of the text which displays the clip information during a shoutout\n\n2. This option only has effect if the options \"Display clip video with shoutouts?\" and \"Display clip information when the clip is displayed on shoutouts?\" are enabled\n\n3. The value entered has to be provided as the HEX color code. For more information about this, check the script documentation\n\n4. It's also possible to use the button on the side to set the color value",
  "clipInfoBgColor": "1. Use this option to set the background color of the zone which displays the clip information during a shoutout\n\n2. This option only has effect if the options \"Display clip video with shoutouts?\" and \"Display clip information when the clip is displayed on shoutouts?\" are enabled\n\n3. The value entered has to be provided as the HEX color code. For more information about this, check the script documentation\n\n4. To change the opacity of the color, provide an HEX color code in the 8 digit format, instead of the usual 6 digit format, where the last to digits make reference to how opaque the background will be (00 means 0% opacitity and ff means 100% opacity)\n\n5. It's also possible to use the button on the side to set the color value",
  "casterName": "1. Use this option to edit enter the caster name you wish to add in the casters database.",
  "casterMessage": "1. Use this option to edit the caster custom message.\n\n2. If this is left blank, no message will be sent with the shoutout. In case this is filled with the word \"DEFAULT\", it will be automatically set to the default message set on \"Message sent by default on shoutouts\" option, on \"Script Settings\".\n\n3. In case you wish to send a custom message, the message used MUST contain the specified parameters, as described below:\n{caster} - this parameter will be replaced by the caster Twitch's username\n{game} - this will be replaced by the last game played by the saved caster on their streams\n{url} - this will be replaced by their Twitch's profile page\n\n3. For more information about this, please refer the script documentation.",
  "addCaster": "1. Use this option to add a new entry to the casters database with the defined options above.\n\n",
  "cancelCaster": "1. Use this option to cancel clear the options above and cancel the process of adding a new caster to the casters database.",
  "casterSelector": "1. Use this oprion to select the saved caster you wish to edit.",
  "editCasterName": "1. Use this option to edit the caster name, in case they have changed their Twitch username.",
  "casterShoutEnable": "1. Use this option to set the status of automatic shoutout for the selected caster.\n\n2. Setting this to \"Enabled\" will trigger the automatic shoutout with all settings defined for the script\n\n3. Setting this to \"Temporarily Disabled\" will disable the automatic shoutout until the option is set again to \"Enabled\".",
  "saveCaster": "1. Use this option to save the changes made to the selected caster to the casters database.",
  "discardCaster": "1. Use this option to cancel all changes made to the selected caster, without saving it to the casters database",
  "deleteCaster": "1. Use this option to permanently delete the selected caster from the casters database."
}
